jajavi202/SUEM-Entrega-2/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTG0 (number 74), J3[5]/PTG0_GPIO7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_G_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_LED_G_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_G_GPIO_PORT kGPIO_PORTG    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_LED_G_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_G_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_G_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_G_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTG1 (number 73), J3[1]/PTG1_GPIO6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_R_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_LED_R_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_R_GPIO_PORT kGPIO_PORTG    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_LED_R_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_R_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_R_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_R_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTG2 (number 72), J3[3]/PTG2_GPIO5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_Y_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_LED_Y_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_Y_GPIO_PORT kGPIO_PORTG    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_LED_Y_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_Y_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_Y_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_Y_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC0 (number 32), J3[4]/PTC0_A1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KEY_1_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_KEY_1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KEY_1_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_KEY_1_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_KEY_1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KEY_1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KEY_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC1 (number 31), J2[3]/J3[6]/PTC1_A2_PWM1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KEY_2_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_KEY_2_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KEY_2_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_KEY_2_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_KEY_2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KEY_2_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KEY_2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC2 (number 25), J3[8]/PTC2_A3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KEY_3_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_KEY_3_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KEY_3_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_KEY_3_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_KEY_3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KEY_3_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KEY_3_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC3 (number 24), J3[10]/PTC3_A4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KEY_4_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_KEY_4_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KEY_4_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_KEY_4_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_KEY_4_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KEY_4_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KEY_4_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTG3 (number 71), J4[15]/PTG3_GPIO4
  @{ */

